<template>
    <div class="backgroundMain">
        <div class="mainContent">
            <div class="textAlign">
                <h1>E寻网用户注册协议</h1>
            </div>
            <div class="mainCon">
                <div>
                    <h4>一、原则</h4>
                    <p>1.1  本条款由会员与***公司（以下简称E寻网）就会员接受E寻网提供的信息服务所订立的权利义务规范。请您在注册成为E寻网会员前，详细阅读本协议条款。当您点选同意键或使用E寻网提供的信息服务时，即表示与E寻网达成协议，同意并接受本服务条款的所有规范并愿意受其约束。</p>
                    <p>1.2  会员是指完全同意本服务条款并按规定完成注册程序，获得会员账号和会员密码的个人、公司和单位。</p>
                </div>
                <div>
                    <h4>二、著作权声明</h4>
                    <p>2.1  E寻网上的所有文字、图形及其组合等，其著作权为E寻网或相关合法权利人所有。未经书面许可，对于E寻网网站上的任何内容，任何单位和个人不得以任何形式复制、转载、变更或出版，不得在非E寻网所属的服务器上做镜像。E寻网有权随时监控会员账号的访问情况，一旦发现上述侵害E寻网权利的行为，即有权在不通知的情况下单方面终止其使用权限，并追究其法律责任。</p>
                    <p>2.2  E寻网内容及所有程序，其著作权属E寻网或授权E寻网使用的合法权利人所有，未经E寻网的授权，不得擅自复制、进行还原工程（reverse engineering）、解编(de-compile)或反向组译(disassemble)任何功能或程序。</p>
                </div>
                <div>
                    <h4>三、会员资料的保护及其限制</h4>
                    <p>3.1  对于会员注册和登录所留存的资料，除下列情形外，E寻网同意在未得到用户同意前，不公开对外披露：</p>
                    <p>3.1.1  基于法律规定；</p>
                    <p>3.1.2  基于司法机关或其它有权机关基于法定程序的要求；</p>
                    <p>3.1.3  为保障E寻网的财产及权益；</p>
                    <p>3.1.4  在紧急情况下为保护其它用户或第三人的人身安全的情形下；</p>
                    <p>3.2  对于会员所登录的个人资料，会员同意E寻网及其关联企业或合作对象，可以在合理范围内搜集、处理、保存、传递及使用该资料，以给会员提供其它信息服务或作为会计资料，或进行网络行为的调查或研究，或其它任何合法使用。</p>
                </div>
                <div>
                    <h4>四、会员的基本义务</h4>
                    <p>4.1  E寻网运用自己的操作系统为会员提供服务。会员应该：</p>
                    <p>4.1.1  自行配备登录互联网所需的全部设备，包括电脑、调制解调器或其他必备装置。</p>
                    <p>4.1.2  自行负担登录互联网所需支付的与此服务有关的网络费用及其他相关的费用。</p>
                    <p>4.1.3  E寻网向会员提供信息服务本身属于商业行为，会员有义务根据E寻网的相关规定和双方的约定向E寻网支付相应的费用。</p>
                    <p>4.1.4  会员有义务妥善保管和使用在E寻网注册得到的会员帐号和密码，并为此帐号及密码登入E寻网后所开始的一连串行为或活动负责。</p>
                    <p>4.2  您承诺绝不为任何非法目的或以任何非法方式使用E寻网，并承诺遵守中华人民共和国法律法规及一切使用因特网的国际惯例。您若系中华人民共和国以外的使用者，并同意遵守所属国家或地域的法令。您同意并保证不对使用（或未使用）E寻网的第三人、E寻网、E寻网的工作人员（包括但不限于董事、监事、经理、员工、顾问、代理人等）、合作伙伴、广告主以及相关合作厂商做出侵害其合法权益之事，包括但不限于：</p>
                    <p>4.2.1  公布或传送任何诽谤、侮辱、具威胁性、攻击性、猥亵、不实、违反公共秩序或善良风俗等的文字、图形或其组合及代码、数字、程序等其他任何形式的档案于E寻网上。</p>
                    <p>4.2.2  侵害他人名誉、荣誉、隐私、商业秘密、商标权、著作权、专利权及其它知识产权和其它合法权利。</p>
                    <p>4.2.3  违反依法律或契约所应负的保密义务。</p>
                    <p>4.2.4  传输或散布计算机病毒，以DOS(Denial Of Service)方式瘫痪E寻网主机而妨碍网站的运作，未经许可进入其它电脑系统。</p>
                    <p>若会员有以上行为时，E寻网的系统记录有可能作为其违反法律的证据；同时，E寻网将作出独立判断立即取消该会员服务帐号，而会员亦应对自己在互联网上的行为独立承担法律后果。</p>
                    <p>4.3  基于E寻网所提供的服务的重要性，会员应同意：</p>
                    <p>4.3.1  提供详尽、准确的个人资料。</p>
                    <p>4.3.2  根据需要更新注册资料，符合及时、详尽、准确的要求。</p>
                </div>
                <div>
                    <h4>五、修改与变更</h4>
                    <P>5.1  由于市场状况的不断变化，E寻网保留随时修改本服务条款的权利，修改本服务条款时，E寻网将于E寻网首页公告修改的事实，而不另对会员进行个别通知。若会员不同意修改的内容，可停止接受E寻网的信息服务。若会员继续接受E寻网提供的信息服务，即视为用会员已接受E寻网所修订的内容。</P>
                    <P>5.2 E寻网行使修改的权利，不需对会员或第三方承担赔偿责任。</P>
                </div>
                <div>
                    <h4>六、服务的停止和更改</h4>
                    <p>6.1  发生下列情形之一时，E寻网有权停止或中断信息服务：</p>
                    <p>6.1.1  对E寻网的网络设备进行必要的保养及施工；</p>
                    <p>6.1.2  发生突发性的网络设备故障时；</p>
                    <p>6.1.3  E寻网所用的网络通信设备因不明原因停止，无法提供服务时；</p>
                    <p>6.1.4  不可抗力因素导致E寻网无法提供信息服务；</p>
                    <p>6.1.5根据中国政府机构的要求；</p>
                    <p>无论任何情形，E寻网对停止、中断会员帐户所可能产生的不便或损害，E寻网对会员本人或任何第三人均不负任何损害赔偿责任。</p>
                    <p>6.2  会员应了解并同意，E寻网的信息服务可能会因本身、其它合作厂商或电信部门网络系统软硬件设备的故障、失灵、或人为操作的疏失而全部或一部分中断、暂时无法使用、迟延或因他人侵入E寻网系统篡改或伪造变造资料等，造成信息服务的停止、中断或用户档案缺失，会员不要求E寻网提供任何的补偿或赔偿。</p>
                </div>
                <div>
                    <h4>七、担保限制</h4>
                    <p>7.1  会员应自行承担使用互联网的风险及由此可能导致的损害，包括但不限于因连接互联网或自行从E寻网网站下载资料、图片等而导致其所使用的计算机系统损害，或发生任何资料的流失等。E寻网对此不负任何明示或默示的担保责任，但对会员的特定目的和不违反本服务条款的适当担保不作限制。</p>
                    <p>7.2  E寻网不担保所提供的服务一定能满足会员的要求，也不担保服务不会中断，对服务的及时性、安全性、发生差错都不作担保。</p>
                    <p>7.3  E寻网对在E寻网上得到的任何商品购物服务或交易进程，不作担保。</p>
                    <p>7.4  E寻网数据来源于互联网和人工整理，不担保所有数据的有效率达到100%，会员同意本条款即视为接受。</p>
                    <p>7.5  E寻网对任何直接、间接、偶然、特殊及继起的损害不负责任，这些损害可能来自：不正当使用网络服务，在网上购买商品或进行同类型服务，在网上进行交易，非法使用网络服务或会员传送的信息有所变动。这些行为都有可能会导致E寻网的形象受损，所以E寻网事先提出这种损害的可能性。</p>
                </div>
                <div>
                    <h4>八、保障</h4>
                    <p>会员同意保障和维护E寻网全体成员的利益，负责支付由会员使用超出服务范围引起的律师费用，违反服务条款的损害补偿费用等。</p>
                </div>
                <div>
                    <h4>九、服务的终止</h4>
                    <p>9.1  会员或E寻网可随时根据实际情况中断一项或多项网络服务。E寻网不需对任何个人或第三方负责而随时中断服务。会员对服务条款的修改、变更有异议，或对E寻网的服务不满，可以行使如下权利：</p>
                    <p>9.1.1  停止使用E寻网的网络服务。</p>
                    <p>9.1.2  通告E寻网停止对该会员的服务。</p>
                    <p>9.2  结束会员服务之时，网络服务的权利马上终止。E寻网不再承担对会员的任何义务，国研网也没有义务传送任何未处理的信息或未完成的服务给用户或第三方。</p>
                </div>
                <div>
                    <h4>十、链接和广告</h4>
                    <p>10.1  E寻网内设有通往其他网站和网页的链接，但这些网站和网页并非由E寻网经营或控制，E寻网不承担责任。会员启动任何此类链接或网页，离开E寻网进入其他网站或网页，所有风险自负，E寻网不承担责任。</p>
                    <p>10.2  E寻网网站可能会刊登部分商业广告或其它活动的促销广告。这些内容系广告商或商品服务提供者所为，E寻网仅是刊登内容的媒介。</p>
                </div>
                <div>
                    <h4>个别条款</h4>
                    <p>本服务条款所定的任何条款的一部或全部无效者，不影响其它条款的效力。</p>
                </div>
                <div>
                    <h4>十二、E寻网服务模式</h4>
                    <p>12.1  E寻网针对用户需求，采用了精准计费模式，充分为用户考虑，大幅降低使用门槛，并使其实际支出与实际使用量合理匹配，同时也可更好地满足部分突发性使用用户的临时需求。 </p>
                    <p>12.2  E寻网会员根据需要自行选择信息服务内容，并根据申请权限选择免费服务或有偿服务。</p>
                </div>
                <div>
                    <h4>十三、管辖法院</h4>
                    <p>本服务条款的解释与适用，以及与本服务条款有关的争议，均适用中华人民共和国法律，并以E寻网所在地人民法院为第一审管辖法院。</p>
                </div>
                <div>
                    <h4>十四、关于免责</h4>
                    <P>就下列相关事宜的发生，E寻网不承担任何法律责任：</P>
                    <P>14.1E寻网根据法律规定或相关政府的要求提供会员的个人信息；</P>
                    <P>14.2由于会员将用户密码告知他人或与他人共享注册账户，由此导致的任何个人信息的泄漏，或其它非因E寻网原因导致的个人信息的泄漏；</P>
                    <P>14.3 任何第三方根据E寻网各服务条款及声明中所列明的情况使用会员的个人信息，由此所产生的纠纷；</P>
                    <p>14.4 任何由于黑客攻击、电脑病毒侵入或政府管制而造成的暂时性网站关闭；</p>
                    <p>14.5因不可抗力导致的任何后果；</p>
                    <p>14.6E寻网在各服务条款及声明中列明的使用方式或免责情形。</p>
                </div>
                <div>
                    <h4>十五、解释权</h4>
                    <p>本服务条款的最终解释权归E寻网所有。</p>
                </div>
                <div class="textAlign" style="margin-top:60px;">
                    <el-button type="primary" @click="toRegister">我知道了</el-button>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    methods:{
        toRegister(){
            this.$router.push('/register')
        }
    }
}
</script>
<style lang="scss">
    .backgroundMain{
        background:#f0f2f7;
        width:100%;
        .mainContent{
            width:70%;
            height:100%;
            background:#fff;
            margin:0 auto;
            padding: 30px 50px;
            .textAlign{
                text-align: center;
                h1{
                    line-height: 60px;
                    font-size: 26px;
                }
            }
        }
        @media screen and (max-width: 1280px){
            .mainContent{
                width:90%;
            }
        }
        .mainCon{
            div{
                margin-bottom:30px;
                h4{
                    font-size:20px;
                    margin-bottom: 30px;
                }
                p{
                    line-height: 30px;
                    font-size: 18px;
                    text-indent: 36px;
                    margin-bottom:20px;
                }
            }
        }
    }
</style>